test-4.0/mixerVesselAMI2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

./makeMesh

cp -r 0.org 0

#runApplication $application
runApplication decomposePar
runParallel $application
runApplication reconstructPar

#------------------------------------------------------------------------------
