test-4.0/mixerVesselAMI2D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dynamicFvMesh   multiSolidBodyMotionFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

dynamicFvMesh   multiBodyRelativeMotionFvMesh;

//motionSolverLibs ( "librelativeDynamicFvMesh.so" );

//multiSolidBodyMotionFvMeshCoeffs
multiBodyRelativeMotionFvMeshCoeffs
{
    rotor
    {
        solidBodyMotionFunction  rotatingMotion;
        rotatingMotionCoeffs
        {
            origin        (0 0 0);
            axis          (0 0 1);
            omega         6.2832; // rad/s
        }
    }
    stator
    {
        solidBodyMotionFunction oscillatingRotatingMotion;
        referenceFrame  rotor;
        oscillatingRotatingMotionCoeffs
        {
            origin          (0 0 0);
            omega           2;         // rad/s
            amplitude       (0 0 45);   // 45 degrees max tilt
        }
    }
}

// ************************************************************************* //
